//=============================================================================
//
// camera_round.h
// Author : koduna hirohito
//
//=============================================================================
#ifndef _CAMERA_ROUND_H_			//このマクロ定義がされなかったら
#define _CAMERA_ROUND_H_			//2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "camera.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CCamera_Round : public CCamera
{
private:
	static const float DISTANCE;
	static const float ROT_MOVE;
public:
	CCamera_Round();
	~CCamera_Round() override;

	HRESULT Init() override;
	void Update() override;
	
private:
	D3DXVECTOR3 m_Rot;
	D3DXVECTOR3 m_RotMove;
};

#endif